Router 18
Router(config)#int fa 0/0
Router(config-if)#ip addr 192.168.26.1 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.21 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.21 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.0 0.0.0.7 area 2
Router(config-router)#network 192.168.26.16 0.0.0.3 area 2
Router(config-router)#network 192.168.26.20 0.0.0.3 area 2
Router(config-router)#exit

Router(config)#int fa 0/0
Router(config-if)#ip helper-address 192.168.26.11
Router(config-if)#exit
-------------------
Requirement:1
-------------------


configure terminal

access-list 150 permit icmp any any
access-list 150 permit tcp any any eq 23
interface Serial 2/0
 ip access-group 150 out
exit
interface Serial 3/0
 ip access-group 150 out
exit
access-list 151 permit icmp any any echo-reply
access-list 151 deny ip any any  
interface FastEthernet0/0
 ip access-group 151 in
exit
===========================================================
--Router 19
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.18 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.26 255.255.255.252
Router(config-if)#no shut


--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.16 0.0.0.3 area 2
Router(config-router)#network 192.168.26.24 0.0.0.3 area 2
Router(config-router)#exit


===========================================================
--Router 17
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.25 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.22 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.29 255.255.255.252
Router(config-if)#no shut

Router(config)#int fa 0/0
Router(config-if)#ip addr 192.168.26.9 255.255.255.248
Router(config-if)#no shut

--OSPF 
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.8 0.0.0.7 area 2
Router(config-router)#network 192.168.26.20 0.0.0.3 area 2
Router(config-router)#network 192.168.26.20 0.0.0.3 area 2
Router(config-router)#network 192.168.26.28 0.0.0.3 area 0
Router(config-router)#exit

enable
configure terminal
enable password 123
username admin password 123
line vty 0 4
 password 123
 login local
exit
line console 0
 password 123
 login local
exit
exit
wr

--ACL


==========================================================
--Router 7
Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.30 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.33 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.37 255.255.255.252
Router(config-if)#no shut


--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.32 0.0.0.7 area 0
Router(config-router)#network 192.168.26.36 0.0.0.7 area 0
Router(config-router)#network 192.168.26.28 0.0.0.7 area 0
Router(config-router)#exit

==========================================================
--Router 5
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.38 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.46 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.149 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.148 0.0.0.3 area 0
Router(config-router)#network 192.168.26.44 0.0.0.3 area 0
Router(config-router)#network 192.168.26.36 0.0.0.3 area 0
Router(config-router)#exit

=========================================================
--Router 4
Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.45 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.42 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 7/0
Router(config-if)#ip addr 192.168.26.94 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.116 0.0.0.3 area 0
Router(config-router)#network 192.168.26.40 0.0.0.3 area 0
Router(config-router)#network 192.168.26.44 0.0.0.3 area 0
Router(config-router)#network 192.168.26.92 0.0.0.3 area 0
Router(config-router)#exit

========================================================
--Router 6
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.41 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.34 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.70 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 7/0
Router(config-if)#ip addr 192.168.26.90 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.68 0.0.0.7 area 0
Router(config-router)#network 192.168.26.40 0.0.0.7 area 0
Router(config-router)#network 192.168.26.32 0.0.0.7 area 0
Router(config-router)#exit

========================================================
--Router 12
Router(config)#int fa 0/0
Router(config-if)#ip addr 192.168.26.49 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.57 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.66 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.48 0.0.0.7 area 3
Router(config-router)#network 192.168.26.56 0.0.0.3 area 3
Router(config-router)#network 192.168.26.64 0.0.0.3 area 3
Router(config-router)#exit

Router(config)#int fa 0/0
Router(config-if)#ip helper-address 192.168.26.11
Router(config-if)#exit

======================================================
--Router 13
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.58 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.61 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.56 0.0.0.3 area 3
Router(config-router)#network 192.168.26.60 0.0.0.3 area 3
Router(config-router)#exit

======================================================
--Router 11
Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.65 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.62 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.69 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.60 0.0.0.3 area 3
Router(config-router)#network 192.168.26.64 0.0.0.3 area 3
Router(config-router)#network 192.168.26.68 0.0.0.3 area 0
Router(config-router)#exit

enable
configure terminal
enable password 123
username admin password 123
line vty 0 4
 password 123
 login local
exit
line console 0
 password 123
 login local
exit
exit
wr

======================================================
--Router 8
Router(config)#int fa 0/0
Router(config-if)#ip addr 192.168.26.73 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.77 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.81 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.76 0.0.0.3 area 4
Router(config-router)#network 192.168.26.72 0.0.0.3 area 4
Router(config-router)#network 192.168.26.80 0.0.0.3 area 4
Router(config-router)#exit

Router(config)#int fa 0/0
Router(config-if)#ip helper-address 192.168.26.11
Router(config-if)#exit

======================================================
--Router 9
Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.82 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.85 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 7/0
Router(config-if)#ip addr 192.168.26.89 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.93 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.84 0.0.0.3 area 4
Router(config-router)#network 192.168.26.80 0.0.0.3 area 4
Router(config-router)#network 192.168.26.88 0.0.0.3 area 0
Router(config-router)#network 192.168.26.92 0.0.0.3 area 0
Router(config-router)#exit

enable
configure terminal
enable password 123
username admin password 123
line vty 0 4
 password 123
 login local
exit
line console 0
 password 123
 login local
exit
exit
wr

======================================================
--Router 10
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.86 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.78 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.76 0.0.0.3 area 4
Router(config-router)#network 192.168.26.84 0.0.0.3 area 4
Router(config-router)#exit

======================================================
--Router 1
Router(config)#int fa 0/0
Router(config-if)#ip addr 192.168.26.97 255.255.255.248 
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.105 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.109 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.96 0.0.0.7 area 5
Router(config-router)#network 192.168.26.104 0.0.0.3 area 5
Router(config-router)#network 192.168.26.108 0.0.0.3 area 5

Router(config)#int fa 0/0
Router(config-if)#ip helper-address 192.168.26.11
Router(config-if)#exit

--ACL Reuirement 6
configure terminal
access-list 103 deny ip 192.168.26.96 0.0.0.7 192.168.26.120 0.0.0.7
access-list 103 permit ip any any
interface FastEthernet0/0
 ip access-group 110 in
end
wr

======================================================
--Router 2
Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.110 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.113 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.117 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.108 0.0.0.3 area 5
Router(config-router)#network 192.168.26.112 0.0.0.3 area 5
Router(config-router)#network 192.168.26.116 0.0.0.3 area 0
Router(config-router)#exit

enable
configure terminal
enable password 123
username admin password 123
line vty 0 4
 password 123
 login local
exit
line console 0
 password 123
 login local
exit
exit
wr


--ACL Requirment 7
enable
configure terminal
access-list 103 deny ip 192.168.26.96 0.0.0.7 host 192.168.26.12   
access-list 103 permit ip any any
interface Serial 6/0
 ip access-group 103 out
exit

============================================================
--Router 3
Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.106 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.114 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.118 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.104 0.0.0.3 area 5
Router(config-router)#network 192.168.26.112 0.0.0.3 area 5

============================================================
--Router 16
Router(config)#int se 6/0
Router(config-if)#ip addr 192.168.26.150 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.146 255.255.255.252
Router(config-if)#no shut

Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.142 255.255.255.252
Router(config-if)#no shut

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.140 0.0.0.3 area 1
Router(config-router)#network 192.168.26.144 0.0.0.3 area 1
Router(config-router)#network 192.168.26.148 0.0.0.3 area 0
Router(config-router)#exit

enable
configure terminal
enable password 123
username admin password 123
line vty 0 4
 password 123
 login local
exit
line console 0
 password 123
 login local
exit
exit
wr

===========================================================
--Router 14
Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.137 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.145 255.255.255.252
Router(config-if)#no shut

Router(config)#int fa 0/0.1
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip addr 192.168.26.121 255.255.255.248
Router(config-subif)#no shut
Router(config-subif)#exit

Router(config)#int fa 0/0.2
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip addr 192.168.26.129 255.255.255.248
Router(config-subif)#no shut
Router(config-subif)#exit

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.136 0.0.0.3 area 1
Router(config-router)#network 192.168.26.144 0.0.0.3 area 1
Router(config-router)#network 192.168.26.128 0.0.0.7 area 1
Router(config-router)#network 192.168.26.120 0.0.0.7 area 1
Router(config-router)#exit

Router(config)#int fa 0/0.1
Router(config-subif)#ip helper-address 192.168.26.11
Router(config-subif)#exit
Router(config)#int fa 0/0.2
Router(config-subif)#exit
Router(config)#int fa 0/0.2
Router(config-subif)#ip helper-address 192.168.26.11
Router(config-subif)#exit

--ACL
Router(config)#access-list 104 deny ip 192.168.26.128 0.0.0.7 192.168.26.48 0.0.0.7 
Router(config)#access-list 104 permit ip any any
Router(config)#int fa 1/0.20
Router(config-subif)#ip access-group 104 out
Router(config-subif)#exit

============================================================
--Router 15
Router(config)#int se 2/0
Router(config-if)#ip addr 192.168.26.138 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int se 3/0
Router(config-if)#ip addr 192.168.26.141 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit

--OSPF
Router(config)#router ospf 1
Router(config-router)#network 192.168.26.140 0.0.0.3 area 1
Router(config-router)#network 192.168.26.136 0.0.0.3 area 1
Router(config-router)#exit

=============================================================
--Switch 6
Switch(config)#vlan 10
Switch(config-vlan)#name postpaid
Switch(config-vlan)#exit
Switch(config)#vlan 20
Switch(config-vlan)#name prepaid
Switch(config-vlan)#exit

Switch(config)#int range fa 0/1, fa 1/1
Switch(config-if-range)#switchport mode trunk
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit

Switch(config)#int range fa 2/1, fa 3/1, fa 6/1
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 10
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit

Switch(config)#interface vlan 10
Switch(config-if)#ip addr 192.168.26.121 255.255.255.248
Switch(config-if)#no shut
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#interface vlan 20	
Switch(config-if)#ip addr 192.168.26.129 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit


Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# switchport port-security mac-address sticky


Switch(config)#spanning-tree mode pvst
Switch(config)#spanning-tree vlan 10 priority 8192
Switch(config)#spanning-tree vlan 20 priority 8192
Switch(config)#exit

=============================================================
--Switch 10
Switch(config)#vlan 10
Switch(config-vlan)#name postpaid
Switch(config-vlan)#exit

Switch(config)#vlan 20
Switch(config-vlan)#name prepaid
Switch(config-vlan)#exit

Switch(config)#int ra fa 2/1,fa3/1
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 10
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit

Switch(config)#int fa 6/1
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport access vlan 20
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int vlan 10
Switch(config-if)#ip addr 192.168.26.121 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int vlan 20
Switch(config-if)#ip addr 192.168.26.129 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int ra fa 0/1,fa 1/1
Switch(config-if-range)#switchport mode trunk 
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit

=================
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# switchport port-security mac-address sticky

Switch(config)#spanning-tree mode pvst
Switch(config)#spanning-tree vlan 10 priority 4096
Switch(config)#spanning-tree vlan 20 priority 4096
Switch(config)#exit

===============================================================
--Switch 11
Switch(config)#vlan 10
Switch(config-vlan)#name postpaid
Switch(config-vlan)#exit

Switch(config)#vlan 20
Switch(config-vlan)#name prepaid
Switch(config-vlan)#exit

Switch(config)#int ra fa0/1,fa1/1
Switch(config-if-range)#switchport mode trunk 
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit

Switch(config)#int ra fa2/1,fa3/1,fa6/1
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 20
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit

Switch(config)#int vlan 10
Switch(config-if)#ip addr 192.168.26.121 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int vlan 20
Switch(config-if)#ip addr 192.168.26.129 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit
==========
Switch(config-if)#  switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# exit

Switch(config)#spanning-tree mode pvst
Switch(config)#spanning-tree vlan 10 priority 8192
Switch(config)#spanning-tree vlan 20 priority 8192
Switch(config)#exit

=============================================================

--Switch 9
Switch(config)#vlan 10
Switch(config-vlan)#name postpaid
Switch(config-vlan)#exit

Switch(config)#vlan 20
Switch(config-vlan)#name prepaid
Switch(config-vlan)#exit

Switch(config)#interface vlan 10
Switch(config-if)#ip addr 192.168.26.121 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#interface vlan 20
Switch(config-if)#ip addr 192.168.26.129 255.255.255.248
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int ra fa 0/1,fa1/1,fa 2/1
Switch(config-if-range)#switchport mode trunk 
Switch(config-if-range)#no shutdown 
Switch(config-if-range)#exit
